# Обучающий тест на основе внутреннего стандарта предприятия

# Вопросы с вариантами ответов сохранены в переменных с цифрами, для упорядоченной сортировки из словаря
num1= '''Вопрос 1
		   Входной контроль - это:
		а) Контроль качества продукции поставщика, поступившей на предприятие,
		б) Контроль качества изготовления продукции на предприятии,
		в) Контроль сопроводительной документации продукции поставщика'''

num2 = '''Вопрос 2
		   Кто проводит ВК ? :
		а) Представители поставщика продукции совместно с ВП
		б) Подразделения организации, указанные в расцеховке документов cовместно с ВП
		в) Представители поставщика совместно с подразделениями организации'''

num3 = '''Вопрос 3
		   Не поздее скольки дней, необходимо провести приемку изделий поступивших на предприятие при 
		   внутригородской и иногородней поставке? :
		а) 5 и 10
		б) 10 и 20
		в) через 14 дней с момента поступления'''

num4 = '''Вопрос 4
		   Какой документ определяет порядок проведения ВК ? :
		а) Настоящий стандарт;
		б) Инструкция по ВК, разработанная организацией-изготовителем изделия;
		в) Ведемость входного контроля, инструкция по ВК и настоящий стандарт.'''

num5 = '''Вопрос 5
		   С кем согласуют организация разработчик и изготовитель, инструкции по ВК изделий, поставляемых 
		   по кооперации? :
		а) С "НПО и ВП;
		б) Организация разработчик и изготовитель согласует инструкцию с внутренними службами;
		в) С ВП РФ закрепленной за органинацией разработчиком.'''

num6 = '''Вопрос 6
		   Где должен проводится ВК изделий поступивших на предприятие ? :
		а) В любом помещении (участке) с тепературой не ниже 18 и не выше 28 градусов цельсия, с 
		   исправной электросетью 220в и 380в, а так же соответтвующей требованиям охраны труда;
		б) В специально отведенном помещении (участке), оборудованном СИ и контроля, а так же отвечающим 
		   требованиям по охране труда и ГОСТ РВ 0015-308;
		в) Помещение для провдения ВК, определяется комиссией по входному контролю совместно с 
		   ВП.'''

num7 = '''Вопрос 7
		   Период аттестации помещения для входного контроля:
		а) Один раз в год;
		б) Один раз в два года;
		в) Два раза в год. '''

num8 = '''Вопрос 8
		  В каком случае проведение ВК осуществляется без оформлениея протокола испытаний?
		а) По решению руководителей подразделений;
		б) В случае повторного проведения ВК;
		в) Если тематика изделия не подлежит контролю ВП.'''

num9 = '''Вопрос 9
		  За сколько дней до поступления изделий, должны быть переданы ВВК, ВПИ и полный коплект
		  документов для проведения ВК, в подразделения проводящие ВК из СГК? 
		а) Комплект документов передается в день поставки изделия;
		б) Не менее чем за 30 дней;
		в) Не менее чем за 20 дней.'''

num10 = '''Вопрос 10
		  Кто разрабатывает технологический процесс ВК ? :
	    а) Предприятие-разработчик изделия;
	    б) СГК НПО;
	    в) Подразделение проводящее ВК.'''

num11 = '''Вопрос 11
		  Период аттестации сотрудников проводящих ВК:
		а) Один раз в год;
		б) Два раза в год;
		в) Один раз в два года.'''

num12 = '''Вопрос 12
		  На основании чего, отдел № 89 разрабатывает МК для проведения ВК ПКИ? : 
		а) На основании служебной записки от службы ГК;
		б) На основании инструкции по ВК, разработанной организацией-изготовителем изделия;
		в) На основании расцеховки отдела № 17.'''

num13 = '''Вопрос 13
		  Кто оформляет заключение в ПИ о соответствии изделия требованиям и проводит запись 
	      о соответствии изделия требованиям ? : 
		а) Подразделение которое является последним в МК;
		б) Подразделение которое является первым в МК (которое принимало изделие);
		в) БТК.'''

num14 = '''Вопрос 14
		  Кто заполняет "Журнал учета результатов ВК изделий" по результатам проведения отдельных операций ? "
		а) Подразделение проводившее ВК;
		б) БТК;
		в) Подразделение проводившее ВК совместно с БТК.'''

# в соваре answers к каждой переменной присвоен правильный вариант ответа
answers = {
	num1: 'а',
	num2: 'б',
    num3: 'б',
    num4: 'в',
    num5: 'а',
    num6: 'б',
    num7: 'б',
	num8: 'в',
	num9: 'б',
	num10: 'в',
	num11: 'а',
	num12: 'в',
	num13: 'а',
	num14: 'а',
}


otvet = [] # список для сохранения количества правильных ответов

def app (): # добавление 1 в список otvet
	otvet.append(1)

for i in answers.keys():
	print(i) # вывод вопроса на экран
	inp = input('') # ввод ответа на вопрос
	if inp == answers[i]: # проверка соответствия введенного значения со значением ключа i
		print('верно')
		print(' ')
		app()
	else:
		print('не верно')
		print(' ')

print(f"У вас {sum(otvet)} правильных ответа из 14 - и")

e = input('Нажмите любую клавишу для выхода') # выход
