'''
Игра Tank_game создана для примера моего кода. Tank_game это простая диалоговая 
консольная игра в дуэль на танках в режиме вопрос-ответ. В игре есть возможность 
выбрать танк из двух типов с разными характеристиками, режим тренировки для 
повышения точности "стрельбы" и режим "бой", где проходит дуэль с вражеским танком.
'''
from Tank_game_class import * # Импорт класса со всеми методами


# Экземпляры класса Tank() с заданными атрибутами Health, Skill, Power.
LT = Tank(10, [0, 0, 0, 1], 2) # Экземпляр "лт" легкий танк
TT = Tank(20, [0, 0, 0, 0, 0, 1], 10) # Экземпляр "тт" тяжелый танк

# В функции game(), цикл предлагает начать игру и выбрать тип танка
def game():
	print("Играть? да/нет")
	select = input("->")
	f = True # флаг 
	while f == True: # пока флаг равен True выполняется проверка ответа

		if select == "да":
			print(f"""
			Выбери тип танка: лт/тт
				лт - быстрое обучение,
					 Сила выстрела - 3
					 Здоровье      - 20
				тт - долгое обучение
					 Сила выстрела - 10
					 Здоровье      - 40 """)
			select_type = input("->") # Предлагается выбрать тип танка, если ответ "да"
			if select_type == "лт":
				print(f"Выбран лт")
				LT.select_tir_or_attack() # Вызов метода режима "бой" или "тренировка" экземпляра LT
			elif select_type == "тт":
				print("Выбран тт")
				TT.select_tir_or_attack() # Вызов метода режима "бой" или "тренировка" экземпляра TT
			else:
				print("Не выбрано ни чего")

		elif select == "нет":
			print("Закрытие программы...")
			exit() 
		else:
			print("Надо выбрать ответ")
			game() # Возврат к началу функции
game()